/**
 * This is a demo for design tokens apply with figma
 */
export declare class MyCard {
    /**
     * ----------------------------------
     * 1.私有属性
     * ----------------------------------
     */
    /**
     * ----------------------------------
     * 2.对WebComponent组件自身的元素引用
     * ----------------------------------
     */
    /**
     * ----------------------------------
     * 3.应用State()装饰器的变量
     * ----------------------------------
     */
    /**
     * ----------------------------------
     * 4.应用Prop()装饰器的公共属性API
     * 每个Prop后面是对应的@Watch()监听事件处理器
     * ----------------------------------
     */
    /** (optional) Link card */
    to?: string;
    /**  可选属性 卡片标签 */
    label?: string;
    /** 是否有阴影 */
    bgshadow: boolean;
    /**
     *  可选属性 可链接卡片的目标
     *  {string}
     */
    target?: string;
    /**
     *  可选属性 卡片引用
     * {string}
     */
    rel?: string;
    /**
     *  可选属性 可注入的CSS样式
     * {string}
     */
    styles?: string;
    /**
     * ----------------------------------
     * 5.自定义事件部分
     * ----------------------------------
     */
    /**
     * ----------------------------------
     * 6.组件生命周期部分
     * ----------------------------------
     */
    connectedCallback(): void;
    componentWillLoad(): void;
    componentDidLoad(): void;
    componentWillUpdate(): void;
    componentDidUpdate(): void;
    componentWillRender(): void;
    componentDidRender(): void;
    disconnectedCallback(): void;
    /**
     * ----------------------------------
     * 7.事件监听器
     * ----------------------------------
     */
    /**
     * ----------------------------------
     * 8.应用Method()装饰器的公共方法
     * ----------------------------------
     */
    /**
     * ----------------------------------
     * 9.私有的本地方法
     * ----------------------------------
     */
    private getCssClassMap;
    /**
     * ----------------------------------
     * 10.render()函数
     * ----------------------------------
     */
    render(): any;
}
